УТ/src/Catalogs/CRM_СервисыКалендарей/CRM_СервисыКалендарей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СервисыКалендарей</name>
  <predefined>
    <items>
      <name>Google</name>
      <description>Google Calendar</description>
    </items>
    <items>
      <name>iCloud</name>
      <description>iCloud Calendar</description>
    </items>
    <items>
      <name>MailRu</name>
      <description>Календарь Mail.ru</description>
    </items>
    <items>
      <name>Яндекс</name>
      <description>Яндекс Календарь</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаНачалаСинхронизации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ/src/CommonModules/CRM_СинхронизацияКалендарейКлиентСервер/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ДанныеАвторизацииЗаполнены(СервисКалендарей, ДанныеАвторизации) Экспорт
	
	Если СервисКалендарей = ПредопределенноеЗначение("Справочник.CRM_СервисыКалендарей.Google") Тогда
		Возврат Не CRM_ОбменСGoogleКлиентСервер.НеЗаполненТокенДоступа(ДанныеАвторизации);
	ИначеЕсли СервисКалендарей = ПредопределенноеЗначение("Справочник.CRM_СервисыКалендарей.Яндекс") 
		Или СервисКалендарей = ПредопределенноеЗначение("Справочник.CRM_СервисыКалендарей.MailRu") 
		Или СервисКалендарей = ПредопределенноеЗначение("Справочник.CRM_СервисыКалендарей.iCloud") Тогда
		Возврат CRM_ОбменСВнешнимиКалендарямиВызовСервера.ДанныеАвторизацииЗаполнены(ДанныеАвторизации);
	Иначе
		Возврат CRM_СинхронизацияКалендарейКлиентСерверПереопределяемый.ДанныеАвторизацииЗаполнены(СервисКалендарей,
			 ДанныеАвторизации);
	КонецЕсли;
	
КонецФункции

#КонецОбласти
